[Killed] Block removal mutation
ProiectTSS/ProiectTSS/Controllers/ShippingController.cs:23:9
     public ActionResult<ShippingQuoteResponse> Quote([FromBody] ShippingQuoteRequest request)
     {
         try
-        {
-            var result = calculatorService.Calculate(request);
-            return Ok(result);
-        }
+        {}
         catch (ArgumentException ex)
         {
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingControllerTests.Quote_WhenServiceSucceeds_ReturnsOkObjectResult; ProiectTSS.UnitTests.ShippingControllerTests.Quote_WhenServiceThrowsArgumentException_ReturnsBadRequestObjectResult

[Killed] Block removal mutation
ProiectTSS/ProiectTSS/Controllers/ShippingController.cs:28:9
             return Ok(result);
         }
         catch (ArgumentException ex)
-        {
-            return BadRequest(new { error = ex.Message });
-        }
+        {}
     }
 }
killedBy: ProiectTSS.UnitTests.ShippingControllerTests.Quote_WhenServiceThrowsArgumentException_ReturnsBadRequestObjectResult
