[Killed] Statement mutation
Proiecte/ProiectTSS/ProiectTSS/Program.cs:9:1
 // Add services to the container.
 
 builder.Services.AddControllers();
-builder.Services.AddScoped<IShippingCalculatorService, ShippingCalculatorService>();
+;
 // Learn more about configuring OpenAPI at https://aka.ms/aspnet/openapi
 builder.Services.AddOpenApi();
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse

[Killed] Statement mutation
Proiecte/ProiectTSS/ProiectTSS/Program.cs:11:1
 builder.Services.AddControllers();
 builder.Services.AddScoped<IShippingCalculatorService, ShippingCalculatorService>();
 // Learn more about configuring OpenAPI at https://aka.ms/aspnet/openapi
-builder.Services.AddOpenApi();
+;
 
 var app = builder.Build();
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenEnvironmentIsDevelopment_MapsOpenApiEndpoint
