[Survived] String mutation
ProiectTSS/ProiectTSS/Dtos/ShippingQuoteResponse.cs:26:47
     /// <summary>
     /// Pipe-separated list of applied pricing rules.
     /// </summary>
-    public string RuleApplied { get; set; } = string.Empty;
+    public string RuleApplied { get; set; } = "Stryker was here!";
 }
 
