[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:31:9
         var model = request.PricingModel;
         var roundingRule = request.RoundingRule;
 
-        ValidateRequest(request, zone, model, roundingRule);
+        ;
 
         var breakdown = new ShippingBreakdown();
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponTypeIsNull_ThrowsArgumentException; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponValueIsNegative_ThrowsArgumentException

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:36:13
         var breakdown = new ShippingBreakdown();
         var rules = new List<string>();
 
-        if (zone is null)
+        if (zone is not null)
         {
             breakdown.BaseFee = request.FallbackZonePrice!.Value;
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:39:13
         if (zone is null)
         {
             breakdown.BaseFee = request.FallbackZonePrice!.Value;
-            rules.Add(RuleFallbackZonePrice);
+            ;
         }
         else
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenZoneIsNullAndFallbackProvided_UsesFallbackBaseFee; ProiectTSS.UnitTests.StrategyWhiteBoxPathTests.Calculate_WhenZoneIsNull_UsesFallbackRulePath

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:43:17
         }
         else
         {
-            if (model == PricingModel.Brackets)
+            if (model != PricingModel.Brackets)
             {
                 rules.Add(RuleBrackets);
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithNationalZone_UsesNationalBaseAndRate

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:45:17
         {
             if (model == PricingModel.Brackets)
             {
-                rules.Add(RuleBrackets);
+                ;
                 foreach (var parcel in request.Parcels)
                 {
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsLocalAndWeightBetween0And1_ReturnsExpectedCost

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:49:21
                 foreach (var parcel in request.Parcels)
                 {
                     var roundedWeight = ApplyRounding(parcel.WeightKg, roundingRule!.Value);
-                    breakdown.PerKgFee += GetBracketFee(zone!.Value, roundedWeight);
+                    breakdown.PerKgFee -= GetBracketFee(zone!.Value, roundedWeight);
                     breakdown.SizeFee += GetSizeFee(zone.Value, parcel.Size!.Value);
                 }
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsAndWeightAbove10_UsesExtraPerKgFee; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsInternationalAndWeightBetween5And10_ReturnsExpectedCost

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:50:21
                 {
                     var roundedWeight = ApplyRounding(parcel.WeightKg, roundingRule!.Value);
                     breakdown.PerKgFee += GetBracketFee(zone!.Value, roundedWeight);
-                    breakdown.SizeFee += GetSizeFee(zone.Value, parcel.Size!.Value);
+                    breakdown.SizeFee -= GetSizeFee(zone.Value, parcel.Size!.Value);
                 }
             }
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsInternationalAndWeightBetween5And10_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsNationalAndWeightBetween1And5_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFixedCouponProvided_AppliesFixedDiscount

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:55:17
             }
             else
             {
-                rules.Add(RuleBasePlusPerKg);
+                ;
                 breakdown.BaseFee = GetBaseFee(zone!.Value);
                 var perKgRate = GetPerKgRate(zone.Value);
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:61:43
                 foreach (var parcel in request.Parcels)
                 {
                     var roundedWeight = ApplyRounding(parcel.WeightKg, roundingRule!.Value);
-                    breakdown.PerKgFee += roundedWeight * perKgRate;
+                    breakdown.PerKgFee += roundedWeight / perKgRate;
                     breakdown.SizeFee += GetSizeFee(zone.Value, parcel.Size!.Value);
                 }
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithNationalZone_UsesNationalBaseAndRate

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:61:21
                 foreach (var parcel in request.Parcels)
                 {
                     var roundedWeight = ApplyRounding(parcel.WeightKg, roundingRule!.Value);
-                    breakdown.PerKgFee += roundedWeight * perKgRate;
+                    breakdown.PerKgFee -= roundedWeight * perKgRate;
                     breakdown.SizeFee += GetSizeFee(zone.Value, parcel.Size!.Value);
                 }
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithNationalZone_UsesNationalBaseAndRate

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:62:21
                 {
                     var roundedWeight = ApplyRounding(parcel.WeightKg, roundingRule!.Value);
                     breakdown.PerKgFee += roundedWeight * perKgRate;
-                    breakdown.SizeFee += GetSizeFee(zone.Value, parcel.Size!.Value);
+                    breakdown.SizeFee -= GetSizeFee(zone.Value, parcel.Size!.Value);
                 }
             }
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenLargeParcelAndInvalidZone_UsesDefaultLargeSizeFee; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenLargeParcelInLocalZone_UsesLocalLargeSizeFee

[Killed] Negate expression
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:67:13
             }
         }
 
-        if (request.Options.Fragil)
+        if (!(request.Options.Fragil))
         {
             breakdown.FragileSurcharge = request.Parcels.Count * 5m;
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsAndWeightAbove10_UsesExtraPerKgFee; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsInternationalAndWeightBetween5And10_ReturnsExpectedCost

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:70:13
         if (request.Options.Fragil)
         {
             breakdown.FragileSurcharge = request.Parcels.Count * 5m;
-            rules.Add(RuleFragileSurcharge);
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.StrategyWhiteBoxPathTests.Calculate_WhenFragileRapidAndCouponAreEnabled_ExecutesCompositeRulePath

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:73:24
             rules.Add(RuleFragileSurcharge);
         }
 
-        var preRapid = breakdown.BaseFee + breakdown.PerKgFee + breakdown.SizeFee + breakdown.FragileSurcharge;
+        var preRapid = breakdown.BaseFee - breakdown.PerKgFee + breakdown.SizeFee + breakdown.FragileSurcharge;
         if (request.Options.Rapid)
         {
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsAndWeightAbove10_UsesExtraPerKgFee

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:73:24
             rules.Add(RuleFragileSurcharge);
         }
 
-        var preRapid = breakdown.BaseFee + breakdown.PerKgFee + breakdown.SizeFee + breakdown.FragileSurcharge;
+        var preRapid = breakdown.BaseFee + breakdown.PerKgFee + breakdown.SizeFee - breakdown.FragileSurcharge;
         if (request.Options.Rapid)
         {
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFragileAndRapidEnabled_AppliesBothSurcharges; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenMaxCapIsSetAndExceeded_AppliesCapReduction

[Killed] Negate expression
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:74:13
         }
 
         var preRapid = breakdown.BaseFee + breakdown.PerKgFee + breakdown.SizeFee + breakdown.FragileSurcharge;
-        if (request.Options.Rapid)
+        if (!(request.Options.Rapid))
         {
             breakdown.RapidSurcharge = preRapid * 0.30m;
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsAndWeightAbove10_UsesExtraPerKgFee; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsInternationalAndWeightBetween5And10_ReturnsExpectedCost

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:76:40
         var preRapid = breakdown.BaseFee + breakdown.PerKgFee + breakdown.SizeFee + breakdown.FragileSurcharge;
         if (request.Options.Rapid)
         {
-            breakdown.RapidSurcharge = preRapid * 0.30m;
+            breakdown.RapidSurcharge = preRapid / 0.30m;
             rules.Add(RuleRapidSurcharge);
         }
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFragileAndRapidEnabled_AppliesBothSurcharges; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenMaxCapIsSetAndExceeded_AppliesCapReduction; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenResultHasManyDecimals_RoundsCurrencyToTwoDecimals

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:77:13
         if (request.Options.Rapid)
         {
             breakdown.RapidSurcharge = preRapid * 0.30m;
-            rules.Add(RuleRapidSurcharge);
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.StrategyWhiteBoxPathTests.Calculate_WhenFragileRapidAndCouponAreEnabled_ExecutesCompositeRulePath

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:80:21
             rules.Add(RuleRapidSurcharge);
         }
 
-        var gross = preRapid + breakdown.RapidSurcharge;
+        var gross = preRapid - breakdown.RapidSurcharge;
         breakdown.SubtotalBeforeDiscounts = RoundCurrency(gross);
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFragileAndRapidEnabled_AppliesBothSurcharges; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenMaxCapIsSetAndExceeded_AppliesCapReduction; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenResultHasManyDecimals_RoundsCurrencyToTwoDecimals

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:84:13
         breakdown.SubtotalBeforeDiscounts = RoundCurrency(gross);
 
         var net = gross;
-        if (request.FreeShippingThreshold is not null && request.Subtotal > request.FreeShippingThreshold)
+        if (request.FreeShippingThreshold is null && request.Subtotal > request.FreeShippingThreshold)
         {
             breakdown.FreeShippingDiscount = net;
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFreeShippingThresholdIsMet_ReturnsZeroShipping

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:84:58
         breakdown.SubtotalBeforeDiscounts = RoundCurrency(gross);
 
         var net = gross;
-        if (request.FreeShippingThreshold is not null && request.Subtotal > request.FreeShippingThreshold)
+        if (request.FreeShippingThreshold is not null && request.Subtotal >= request.FreeShippingThreshold)
         {
             breakdown.FreeShippingDiscount = net;
killedBy: ProiectTSS.UnitTests.StrategyBlackBoxTests.Calculate_WhenSubtotalEqualsFreeShippingThreshold_DoesNotApplyFreeShipping

[Survived] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:88:13
         {
             breakdown.FreeShippingDiscount = net;
             net = 0m;
-            rules.Add(RuleFreeShippingThreshold);
+            ;
         }
         else if (request.Coupon is not null)

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:90:18
             net = 0m;
             rules.Add(RuleFreeShippingThreshold);
         }
-        else if (request.Coupon is not null)
+        else if (request.Coupon is null)
         {
             breakdown.CouponDiscount = CalculateCouponDiscount(net, request.Coupon);
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:93:13
         else if (request.Coupon is not null)
         {
             breakdown.CouponDiscount = CalculateCouponDiscount(net, request.Coupon);
-            net -= breakdown.CouponDiscount;
+            net += breakdown.CouponDiscount;
             rules.Add(RuleCouponDiscount);
         }
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFixedCouponExceedsShipping_ClampsDiscountToShippingCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFixedCouponProvided_AppliesFixedDiscount; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenPercentCouponProvided_AppliesPercentDiscount

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:94:13
         {
             breakdown.CouponDiscount = CalculateCouponDiscount(net, request.Coupon);
             net -= breakdown.CouponDiscount;
-            rules.Add(RuleCouponDiscount);
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponIsApplied_RuleAppliedContainsCouponDiscountToken; ProiectTSS.UnitTests.StrategyWhiteBoxPathTests.Calculate_WhenFragileRapidAndCouponAreEnabled_ExecutesCompositeRulePath

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:97:13
             rules.Add(RuleCouponDiscount);
         }
 
-        if (request.MaxCap is not null && request.MaxCap >= 0 && net > request.MaxCap)
+        if (request.MaxCap is null && request.MaxCap >= 0 && net > request.MaxCap)
         {
             breakdown.CapReduction = net - request.MaxCap.Value;
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCapIsApplied_RuleAppliedContainsMaxCapToken; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenMaxCapIsSetAndExceeded_AppliesCapReduction

[Killed] Negate expression
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:97:13
             rules.Add(RuleCouponDiscount);
         }
 
-        if (request.MaxCap is not null && request.MaxCap >= 0 && net > request.MaxCap)
+        if (!(request.MaxCap is not null && request.MaxCap >= 0 && net > request.MaxCap))
         {
             breakdown.CapReduction = net - request.MaxCap.Value;
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:99:38
 
         if (request.MaxCap is not null && request.MaxCap >= 0 && net > request.MaxCap)
         {
-            breakdown.CapReduction = net - request.MaxCap.Value;
+            breakdown.CapReduction = net + request.MaxCap.Value;
             net = request.MaxCap.Value;
             rules.Add(RuleMaxCap);
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenMaxCapIsSetAndExceeded_AppliesCapReduction

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:101:13
         {
             breakdown.CapReduction = net - request.MaxCap.Value;
             net = request.MaxCap.Value;
-            rules.Add(RuleMaxCap);
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCapIsApplied_RuleAppliedContainsMaxCapToken

[Killed] Object initializer mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:114:16
         breakdown.CapReduction = RoundCurrency(breakdown.CapReduction);
         breakdown.SubtotalAfterDiscounts = RoundCurrency(net);
 
-        return new ShippingQuoteResponse
-        {
-            ShippingCost = breakdown.SubtotalAfterDiscounts,
-            Currency = "RON",
-            Breakdown = breakdown,
-            RuleApplied = string.Join(" | ", rules)
-        };
+        return new ShippingQuoteResponse
+{};
     }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithNationalZone_UsesNationalBaseAndRate

[Survived] String mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:119:39
             ShippingCost = breakdown.SubtotalAfterDiscounts,
             Currency = "RON",
             Breakdown = breakdown,
-            RuleApplied = string.Join(" | ", rules)
+            RuleApplied = string.Join("", rules)
         };
     }

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:139:13
     {
         if (request.Parcels.Count == 0)
         {
-            throw new ArgumentException("parcels must contain at least one item.");
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenParcelsAreEmpty_ThrowsArgumentException

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:142:38
             throw new ArgumentException("parcels must contain at least one item.");
         }
 
-        if (request.Parcels.Any(p => p.WeightKg < 0))
+        if (request.Parcels.Any(p => p.WeightKg > 0))
         {
             throw new ArgumentException("weightKg must be >= 0.");
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Negate expression
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:142:13
             throw new ArgumentException("parcels must contain at least one item.");
         }
 
-        if (request.Parcels.Any(p => p.WeightKg < 0))
+        if (!(request.Parcels.Any(p => p.WeightKg < 0)))
         {
             throw new ArgumentException("weightKg must be >= 0.");
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:144:13
 
         if (request.Parcels.Any(p => p.WeightKg < 0))
         {
-            throw new ArgumentException("weightKg must be >= 0.");
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenParcelWeightIsNegative_ThrowsArgumentException

[Killed] Negate expression
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:147:13
             throw new ArgumentException("weightKg must be >= 0.");
         }
 
-        if (request.Subtotal < 0)
+        if (!(request.Subtotal < 0))
         {
             throw new ArgumentException("subtotal must be >= 0.");
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:147:13
             throw new ArgumentException("weightKg must be >= 0.");
         }
 
-        if (request.Subtotal < 0)
+        if (request.Subtotal > 0)
         {
             throw new ArgumentException("subtotal must be >= 0.");
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:149:13
 
         if (request.Subtotal < 0)
         {
-            throw new ArgumentException("subtotal must be >= 0.");
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenSubtotalIsNegative_ThrowsArgumentException

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:152:13
             throw new ArgumentException("subtotal must be >= 0.");
         }
 
-        if (zone is null && request.FallbackZonePrice is null)
+        if (zone is not null && request.FallbackZonePrice is null)
         {
             throw new ArgumentException("zone is unknown and fallbackZonePrice is missing.");
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:152:29
             throw new ArgumentException("subtotal must be >= 0.");
         }
 
-        if (zone is null && request.FallbackZonePrice is null)
+        if (zone is null && request.FallbackZonePrice is not null)
         {
             throw new ArgumentException("zone is unknown and fallbackZonePrice is missing.");
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenZoneIsNullAndFallbackIsNegative_ThrowsArgumentException; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenZoneIsNullAndFallbackMissing_ThrowsArgumentException; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenZoneIsNullAndFallbackProvided_UsesFallbackBaseFee

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:154:13
 
         if (zone is null && request.FallbackZonePrice is null)
         {
-            throw new ArgumentException("zone is unknown and fallbackZonePrice is missing.");
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenZoneIsNullAndFallbackMissing_ThrowsArgumentException

[Killed] String mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:154:41
 
         if (zone is null && request.FallbackZonePrice is null)
         {
-            throw new ArgumentException("zone is unknown and fallbackZonePrice is missing.");
+            throw new ArgumentException("");
         }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenZoneIsNullAndFallbackMissing_ThrowsArgumentException

[Killed] Negate expression
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:157:13
             throw new ArgumentException("zone is unknown and fallbackZonePrice is missing.");
         }
 
-        if (zone is null && request.FallbackZonePrice < 0)
+        if (!(zone is null && request.FallbackZonePrice < 0))
         {
             throw new ArgumentException("Unknown zone requires fallbackZonePrice.");
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Logical mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:157:13
             throw new ArgumentException("zone is unknown and fallbackZonePrice is missing.");
         }
 
-        if (zone is null && request.FallbackZonePrice < 0)
+        if (zone is null || request.FallbackZonePrice < 0)
         {
             throw new ArgumentException("Unknown zone requires fallbackZonePrice.");
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenZoneIsNullAndFallbackProvided_UsesFallbackBaseFee; ProiectTSS.UnitTests.StrategyRandomizedFuzzingTests.Calculate_WhenRandomValidInputsAreGenerated_PreservesBasicInvariants; ProiectTSS.UnitTests.StrategyWhiteBoxPathTests.Calculate_WhenZoneIsNull_UsesFallbackRulePath

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:159:13
 
         if (zone is null && request.FallbackZonePrice < 0)
         {
-            throw new ArgumentException("Unknown zone requires fallbackZonePrice.");
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenZoneIsNullAndFallbackIsNegative_ThrowsArgumentException

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:162:13
             throw new ArgumentException("Unknown zone requires fallbackZonePrice.");
         }
 
-        if (model is null)
+        if (model is not null)
         {
             throw new ArgumentException("pricingModel must be explicitly set.");
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:164:13
 
         if (model is null)
         {
-            throw new ArgumentException("pricingModel must be explicitly set.");
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenPricingModelIsNull_ThrowsArgumentException
