[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:167:13
             throw new ArgumentException("pricingModel must be explicitly set.");
         }
 
-        if (roundingRule is null)
+        if (roundingRule is not null)
         {
             throw new ArgumentException("roundingRule must be explicitly set.");
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:169:13
 
         if (roundingRule is null)
         {
-            throw new ArgumentException("roundingRule must be explicitly set.");
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenRoundingRuleIsNull_ThrowsArgumentException

[Killed] Negate expression
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:172:13
             throw new ArgumentException("roundingRule must be explicitly set.");
         }
 
-        if (request.Parcels.Any(p => p.Size is null))
+        if (!(request.Parcels.Any(p => p.Size is null)))
         {
             throw new ArgumentException("parcel size must be explicitly set.");
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:172:38
             throw new ArgumentException("roundingRule must be explicitly set.");
         }
 
-        if (request.Parcels.Any(p => p.Size is null))
+        if (request.Parcels.Any(p => p.Size is not null))
         {
             throw new ArgumentException("parcel size must be explicitly set.");
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:174:13
 
         if (request.Parcels.Any(p => p.Size is null))
         {
-            throw new ArgumentException("parcel size must be explicitly set.");
+            ;
         }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenParcelSizeIsNull_ThrowsArgumentException

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:177:13
             throw new ArgumentException("parcel size must be explicitly set.");
         }
 
-        if (request.Coupon is not null)
+        if (request.Coupon is null)
         {
             if (request.Coupon.Type is null)
killedBy: ProiectTSS.UnitTests.ProgramStartupTests.Startup_WhenPostingShippingQuote_ReturnsSuccessfulResponse; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:179:17
 
         if (request.Coupon is not null)
         {
-            if (request.Coupon.Type is null)
+            if (request.Coupon.Type is not null)
             {
                 throw new ArgumentException("coupon.type must be explicitly set.");
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponIsApplied_RuleAppliedContainsCouponDiscountToken; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponTypeHasInvalidEnumValue_UsesZeroDiscountDefaultBranch; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponTypeIsNull_ThrowsArgumentException

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:181:17
         {
             if (request.Coupon.Type is null)
             {
-                throw new ArgumentException("coupon.type must be explicitly set.");
+                ;
             }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponTypeIsNull_ThrowsArgumentException; ProiectTSS.UnitTests.StrategyWhiteBoxPathTests.Calculate_WhenCouponExistsButTypeMissing_ThrowsValidationException

[Killed] Negate expression
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:184:17
                 throw new ArgumentException("coupon.type must be explicitly set.");
             }
 
-            if (request.Coupon.Value < 0)
+            if (!(request.Coupon.Value < 0))
             {
                 throw new ArgumentException("coupon.value must be >= 0.");
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponIsApplied_RuleAppliedContainsCouponDiscountToken; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponTypeHasInvalidEnumValue_UsesZeroDiscountDefaultBranch; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponValueIsNegative_ThrowsArgumentException

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:184:17
                 throw new ArgumentException("coupon.type must be explicitly set.");
             }
 
-            if (request.Coupon.Value < 0)
+            if (request.Coupon.Value > 0)
             {
                 throw new ArgumentException("coupon.value must be >= 0.");
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponIsApplied_RuleAppliedContainsCouponDiscountToken; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponTypeHasInvalidEnumValue_UsesZeroDiscountDefaultBranch; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponValueIsNegative_ThrowsArgumentException

[Killed] Statement mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:186:17
 
             if (request.Coupon.Value < 0)
             {
-                throw new ArgumentException("coupon.value must be >= 0.");
+                ;
             }
         }
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponValueIsNegative_ThrowsArgumentException

[Killed] String mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:186:45
 
             if (request.Coupon.Value < 0)
             {
-                throw new ArgumentException("coupon.value must be >= 0.");
+                throw new ArgumentException("");
             }
         }
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponValueIsNegative_ThrowsArgumentException

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:201:61
     {
         decimal discount = coupon.Type switch
         {
-            CouponType.Percent => shippingBeforeDiscount * (coupon.Value / 100m),
+            CouponType.Percent => shippingBeforeDiscount * (coupon.Value * 100m),
             CouponType.Fixed => coupon.Value,
             _ => 0m
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenPercentCouponProvided_AppliesPercentDiscount

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:201:35
     {
         decimal discount = coupon.Type switch
         {
-            CouponType.Percent => shippingBeforeDiscount * (coupon.Value / 100m),
+            CouponType.Percent => shippingBeforeDiscount / (coupon.Value / 100m),
             CouponType.Fixed => coupon.Value,
             _ => 0m
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenPercentCouponProvided_AppliesPercentDiscount

[Killed] Linq method mutation (Max() to Min())
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:206:49
             _ => 0m
         };
 
-        return Math.Min(shippingBeforeDiscount, Math.Max(0m, discount));
+        return Math.Min(shippingBeforeDiscount, Math.Min(0m, discount));
     }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFixedCouponExceedsShipping_ClampsDiscountToShippingCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFixedCouponProvided_AppliesFixedDiscount; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenPercentCouponProvided_AppliesPercentDiscount

[Killed] Linq method mutation (Min() to Max())
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:206:16
             _ => 0m
         };
 
-        return Math.Min(shippingBeforeDiscount, Math.Max(0m, discount));
+        return Math.Max(shippingBeforeDiscount, Math.Max(0m, discount));
     }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponTypeHasInvalidEnumValue_UsesZeroDiscountDefaultBranch; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFixedCouponExceedsShipping_ClampsDiscountToShippingCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFixedCouponProvided_AppliesFixedDiscount

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:220:52
         return roundingRule switch
         {
             RoundingRule.Ceil1Kg => Math.Ceiling(weightKg),
-            RoundingRule.Ceil0_5Kg => Math.Ceiling(weightKg * 2m) / 2m,
+            RoundingRule.Ceil0_5Kg => Math.Ceiling(weightKg / 2m) / 2m,
             _ => weightKg
         };
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenRoundingCeilHalfKg_AppliesRoundedWeight

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:220:39
         return roundingRule switch
         {
             RoundingRule.Ceil1Kg => Math.Ceiling(weightKg),
-            RoundingRule.Ceil0_5Kg => Math.Ceiling(weightKg * 2m) / 2m,
+            RoundingRule.Ceil0_5Kg => Math.Ceiling(weightKg * 2m) * 2m,
             _ => weightKg
         };
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenRoundingCeilHalfKg_AppliesRoundedWeight

[Killed] Negate expression
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:241:13
             _ => throw new ArgumentException("Unknown zone.")
         };
 
-        if (weightKg <= 1m)
+        if (!(weightKg <= 1m))
         {
             return rates[0];
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsAndWeightAbove10_UsesExtraPerKgFee; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsInternationalAndWeightBetween5And10_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsLocalAndWeightBetween0And1_ReturnsExpectedCost

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:241:13
             _ => throw new ArgumentException("Unknown zone.")
         };
 
-        if (weightKg <= 1m)
+        if (weightKg > 1m)
         {
             return rates[0];
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsAndWeightAbove10_UsesExtraPerKgFee; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsInternationalAndWeightBetween5And10_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsLocalAndWeightBetween0And1_ReturnsExpectedCost

[Killed] Block removal mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:242:9
         };
 
         if (weightKg <= 1m)
-        {
-            return rates[0];
-        }
+        {}
 
         if (weightKg <= 5m)
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsLocalAndWeightBetween0And1_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenMultipleParcels_AggregatesAllParcelCosts; ProiectTSS.UnitTests.StrategyBlackBoxTests.Calculate_WhenWeightAtBoundary_ReturnsExpectedBracketTransition(1.0d,8)

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:246:13
             return rates[0];
         }
 
-        if (weightKg <= 5m)
+        if (weightKg > 5m)
         {
             return rates[1];
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsAndWeightAbove10_UsesExtraPerKgFee; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsInternationalAndWeightBetween5And10_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsNationalAndWeightBetween1And5_ReturnsExpectedCost

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:246:13
             return rates[0];
         }
 
-        if (weightKg <= 5m)
+        if (weightKg < 5m)
         {
             return rates[1];
killedBy: ProiectTSS.UnitTests.StrategyBlackBoxTests.Calculate_WhenWeightAtBoundary_ReturnsExpectedBracketTransition(5.0d,15)

[Killed] Block removal mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:247:9
         }
 
         if (weightKg <= 5m)
-        {
-            return rates[1];
-        }
+        {}
 
         if (weightKg <= 10m)
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsNationalAndWeightBetween1And5_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenCouponTypeHasInvalidEnumValue_UsesZeroDiscountDefaultBranch; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenFixedCouponExceedsShipping_ClampsDiscountToShippingCost

[Killed] Equality mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:251:13
             return rates[1];
         }
 
-        if (weightKg <= 10m)
+        if (weightKg > 10m)
         {
             return rates[2];
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsAndWeightAbove10_UsesExtraPerKgFee; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsInternationalAndWeightBetween5And10_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenMaxCapIsSetAndExceeded_AppliesCapReduction

[Killed] Negate expression
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:251:13
             return rates[1];
         }
 
-        if (weightKg <= 10m)
+        if (!(weightKg <= 10m))
         {
             return rates[2];
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsAndWeightAbove10_UsesExtraPerKgFee; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsInternationalAndWeightBetween5And10_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenMaxCapIsSetAndExceeded_AppliesCapReduction

[Killed] Block removal mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:252:9
         }
 
         if (weightKg <= 10m)
-        {
-            return rates[2];
-        }
+        {}
 
         return rates[2] + ((weightKg - 10m) * rates[3]);
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsInternationalAndWeightBetween5And10_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenMaxCapIsSetAndExceeded_AppliesCapReduction; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenMultipleParcels_AggregatesAllParcelCosts

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:256:29
             return rates[2];
         }
 
-        return rates[2] + ((weightKg - 10m) * rates[3]);
+        return rates[2] + ((weightKg + 10m) * rates[3]);
     }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsAndWeightAbove10_UsesExtraPerKgFee; ProiectTSS.UnitTests.StrategyBlackBoxTests.Calculate_WhenWeightAtBoundary_ReturnsExpectedBracketTransition(10.01d,25.03d)

[Killed] Arithmetic mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:256:28
             return rates[2];
         }
 
-        return rates[2] + ((weightKg - 10m) * rates[3]);
+        return rates[2] + ((weightKg - 10m) / rates[3]);
     }
 
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsAndWeightAbove10_UsesExtraPerKgFee; ProiectTSS.UnitTests.StrategyBlackBoxTests.Calculate_WhenWeightAtBoundary_ReturnsExpectedBracketTransition(10.01d,25.03d)

[Killed] Block removal mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:265:5
     /// <param name="zone">Delivery zone used for tariff selection.</param>
     /// <returns>Base fee for the specified zone.</returns>
     private static decimal GetBaseFee(ShippingZone zone)
-    {
-        return zone switch
-        {
-            ShippingZone.Local => 10m,
-            ShippingZone.National => 15m,
-            ShippingZone.International => 30m,
-            _ => 20m
-        };
-    }
+    {}
 
     /// <summary>
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithNationalZone_UsesNationalBaseAndRate

[Killed] Block removal mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:281:5
     /// <param name="zone">Delivery zone used for tariff selection.</param>
     /// <returns>Per-kilogram rate for the specified zone.</returns>
     private static decimal GetPerKgRate(ShippingZone zone)
-    {
-        return zone switch
-        {
-            ShippingZone.Local => 2m,
-            ShippingZone.National => 3m,
-            ShippingZone.International => 6m,
-            _ => 2.5m
-        };
-    }
+    {}
 
     /// <summary>
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithInternationalZone_UsesInternationalBaseAndRate; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgWithNationalZone_UsesNationalBaseAndRate

[Killed] Block removal mutation
ProiectTSS/ProiectTSS/Services/ShippingCalculatorService.cs:298:5
     /// <param name="size">Parcel size category.</param>
     /// <returns>Additional fee based on parcel size and zone.</returns>
     private static decimal GetSizeFee(ShippingZone zone, ParcelSize size)
-    {
-        return size switch
-        {
-            ParcelSize.Small => 0m,
-            ParcelSize.Medium => zone switch
-            {
-                ShippingZone.Local => 2m,
-                ShippingZone.National => 3m,
-                ShippingZone.International => 6m,
-                _ => 3m
-            },
-            ParcelSize.Large => zone switch
-            {
-                ShippingZone.Local => 5m,
-                ShippingZone.National => 8m,
-                ShippingZone.International => 15m,
-                _ => 8m
-            },
-            _ => 0m
-        };
-    }
+    {}
 
     /// <summary>
killedBy: ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBasePlusPerKgModel_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsInternationalAndWeightBetween5And10_ReturnsExpectedCost; ProiectTSS.UnitTests.ShippingCalculatorServiceTests.Calculate_WhenBracketsNationalAndWeightBetween1And5_ReturnsExpectedCost
